# Яка країна випустила найбільше старих фільмів (дата прем’єри до 1960 року), доступних на Netflix?
import pandas as pd

# Імпорт бібліотеки pandas під псевдонімом 'pd' і завантаження даних з CSV-файлу 'netflix_titles.csv' у DataFrame 'df'.
df = pd.read_csv('netflix_titles.csv')

# Вибір фільмів (записів з типом 'Movie') та обмеження їх за релізним роком, який не перевищує 1960 рік.
# Результат зберігається у DataFrame 'film_year'.
film_year = df[(df['type'] == 'Movie') & (df['release_year'] <= 1960)]

# Обчислення кількості фільмів, випущених в кожній країні, і збереження цих значень у зміній 'country'.
country = film_year['country'].value_counts()

# Вибірка країни з найбільшою кількістю фільмів і збереження цієї інформації у зміній 'top1'.
top1 = country.head(5)

# Виведення результату (країни з найбільшою кількістю фільмів, випущених до 1960 року) на екран.
print(top1)