# Визначте ТОП-10 країн за кількістю проектів на Netflix. Побудуйте діаграму їх розподілу.
import pandas
import matplotlib.pyplot as plt

# Імпорт бібліотеки pandas і matplotlib та завантаження даних з CSV-файлу 'netflix_titles.csv' у DataFrame 'df'.
df = pandas.read_csv('netflix_titles.csv')

# Обчислення кількості фільмів і серіалів за країною (за значеннями в стовпці 'country') і збереження цих значень у зміній 'county'.
county = df['country'].value_counts()

# Вибірка перших 10 країн з найбільшою кількістю фільмів і серіалів і збереження їх у зміній 'top10'.
top10 = county.head(10)

# Побудова стовпчикової діаграми для візуалізації 10 країн з найбільшою кількістю фільмів і серіалів.
top10.plot(kind='bar')

# Налаштування компактного розташування елементів графіку.
plt.tight_layout()

# Відображення графіку на екрані.
plt.show()
